##########################################################################################
#                      МАРШРУТ ДЛЯ ОПЕРАЦИЙ С ЧАТАМИ, СООБЩЕНИЯМИ                        #
##########################################################################################

# Инструменты FastAPI
from fastapi import APIRouter

# Создание экземпляра маршрута, все пути которые относятся к этому маршруту 
# будут начинаться с /messanger
messanger = APIRouter(
    prefix='/messanger',
    tags=["messanger"],
)

@messanger.get('/')
async def get_user():
    return {'messanger': 'hello! text!'}