##########################################################################################
#                              МАРШРУТ ДЛЯ ОПЕРАЦИЙ ТОВАРАМИ                             #
##########################################################################################

# Инструменты FastAPI
from fastapi import APIRouter

# Создание экземпляра маршрута, все пути которые относятся к этому маршруту 
# будут начинаться с /products
products = APIRouter(
    prefix='/products',
    tags=["products"],
)

@products.get('/')
async def get_user():
    return {'products': 'hello! text!'}